<a href="https://colab.research.google.com/github/MariyaJosep/Data-Science-Statistics-Numpy-Pandas/blob/main/Data_Science_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
#creating dictionay
emp_dict = {
    'eno':[100, 200, 300, 400, 500],
    'ename':['kumar', 'abcd', 'xyz', 'rahul', 'ram'],
    'salary':[24000, 20000, 15000, 30000, 20000],
    'did':[1,1,2,3,3]
    
}

In [ ]:
emp_dict

{'eno': [100, 200, 300, 400, 500],
 'ename': ['kumar', 'abcd', 'xyz', 'rahul', 'ram'],
 'salary': [24000, 20000, 15000, 30000, 20000],
 'did': [1, 1, 2, 3, 3]}

In [ ]:
#creating dataframe(table)
emp_df = pd.DataFrame(emp_dict)

In [ ]:
emp_df

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
print(emp_df)

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#finding no of rows and columns
emp_df.shape

(5, 4)

In [ ]:
#finding total elements
emp_df.size

20

In [ ]:
#finding column names
emp_df.columns

Index(['eno', 'ename', 'salary', 'did'], dtype='object')

In [ ]:
#finding index labels
emp_df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
#finiding data type of each column
emp_df.dtypes

eno        int64
ename     object
salary     int64
did        int64
dtype: object

In [ ]:
#extract data as numpy array (2D-array)
emp_df.values

array([[100, 'kumar', 24000, 1],
       [200, 'abcd', 20000, 1],
       [300, 'xyz', 15000, 2],
       [400, 'rahul', 30000, 3],
       [500, 'ram', 20000, 3]], dtype=object)

In [ ]:
#extracting only eno column values as series
emp_df['eno']

0    100
1    200
2    300
3    400
4    500
Name: eno, dtype: int64

In [ ]:
#extracting only eno column values as values(array)
emp_df['eno'].values

array([100, 200, 300, 400, 500], dtype=int64)

In [ ]:
#extracting only ename column values
emp_df['ename']

0    kumar
1     abcd
2      xyz
3    rahul
4      ram
Name: ename, dtype: object

In [ ]:
#extracting eno & ename
column_names = ['eno', 'ename']
emp_df[column_names]

   eno  ename
0  100  kumar
1  200   abcd
2  300    xyz
3  400  rahul
4  500    ram

In [ ]:
#extracting ename & salary
column_names = ['ename','salary']
emp_df[column_names]

   ename  salary
0  kumar   24000
1   abcd   20000
2    xyz   15000
3  rahul   30000
4    ram   20000

In [ ]:
#extracting salary & name
column_names = ['salary', 'ename']
emp_df[column_names]

   salary  ename
0   24000  kumar
1   20000   abcd
2   15000    xyz
3   30000  rahul
4   20000    ram

In [ ]:
emp_df

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#extracting all columns between 'ename' and 'did'
column_names = ['ename':'did']
emp_df[column_names]

SyntaxError: invalid syntax (1016379917.py, line 2)

In [ ]:
#extracing 1st row using loc property
emp_df.loc[0,]

eno         100
ename     kumar
salary    24000
did           1
Name: 0, dtype: object

In [ ]:
#extracing 2nd row using loc property
emp_df.loc[1,]

eno         200
ename      abcd
salary    20000
did           1
Name: 1, dtype: object

In [ ]:
#extracing 2nd and 4th row using loc property
emp_df.loc[[1,3],]

   eno  ename  salary  did
1  200   abcd   20000    1
3  400  rahul   30000    3

In [ ]:
#extracing 2nd and 4th row eno values
emp_df.loc[[1,3],'eno']

1    200
3    400
Name: eno, dtype: int64

In [ ]:
#extracing 2nd and 4th row eno and salary values
emp_df.loc[[1,3],['eno', 'salary']]

   eno  salary
1  200   20000
3  400   30000

In [ ]:
#extracing rows between 1 & 3 rows
emp_df.loc[1:3,['eno', 'salary']]

   eno  salary
1  200   20000
2  300   15000
3  400   30000

In [ ]:
#extracing rows between 1 & 3 rows
emp_df.loc[1:3,]

   eno  ename  salary  did
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3

In [ ]:
#extracing rows between 1 & 3 rows and columns between ename & did
emp_df.loc[1:3,'ename':'did']

   ename  salary  did
1   abcd   20000    1
2    xyz   15000    2
3  rahul   30000    3

In [ ]:
#extracting 1st row and 1st column value using iloc
emp_df.iloc[0,0]

100

In [ ]:
#extracting 1st row values using iloc
emp_df.iloc[0,]

eno         100
ename     kumar
salary    24000
did           1
Name: 0, dtype: object

In [ ]:
#extracting 1st row values using iloc
emp_df.iloc[3,]

eno         400
ename     rahul
salary    30000
did           3
Name: 3, dtype: object

In [ ]:
#extracting 1st & 5th row values using iloc
emp_df.iloc[[0,4],]

   eno  ename  salary  did
0  100  kumar   24000    1
4  500    ram   20000    3

In [ ]:
#extracting 1st & 5th row values and ename & salary information using iloc
emp_df.iloc[[0,4],[1,2]]

   ename  salary
0  kumar   24000
4    ram   20000

In [ ]:
#extracting 1st & 5th row values and ename & did information using iloc
emp_df.iloc[[0,4],[1,3]]

   ename  did
0  kumar    1
4    ram    3

In [ ]:
#extracting 1st to 4th row values and ename & did information using iloc
emp_df.iloc[0:4,[1,3]]

   ename  did
0  kumar    1
1   abcd    1
2    xyz    2
3  rahul    3

In [ ]:
#extracting 2nd to 4th row values and ename & did information using iloc
emp_df.iloc[1:4,[1,3]]

   ename  did
1   abcd    1
2    xyz    2
3  rahul    3

In [ ]:
#extrating top 5 rows using head()
emp_df.head()

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#extrating top 2 rows using head()
emp_df.head(2)

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1

In [ ]:
#extrating bottom 5 rows using tail()
emp_df.tail()

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#extrating bottom 3 rows using tail()
emp_df.tail(3)

   eno  ename  salary  did
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#describing dataframe
emp_df.describe()

              eno        salary  did
count    5.000000      5.000000  5.0
mean   300.000000  21800.000000  2.0
std    158.113883   5585.696018  1.0
min    100.000000  15000.000000  1.0
25%    200.000000  20000.000000  1.0
50%    300.000000  20000.000000  2.0
75%    400.000000  24000.000000  3.0
max    500.000000  30000.000000  3.0

In [ ]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eno     5 non-null      int64
 1   ename   5 non-null      object
 2   salary  5 non-null      int64
 3   did     5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [ ]:
display(emp_df)

   eno  ename  salary  did
0  100  kumar   24000    1
1  200   abcd   20000    1
2  300    xyz   15000    2
3  400  rahul   30000    3
4  500    ram   20000    3

In [ ]:
#finding max value based column
emp_df.apply('max')

eno         500
ename       xyz
salary    30000
did           3
dtype: object

In [ ]:
#finding min value based column
emp_df.apply('min')

eno         100
ename      abcd
salary    15000
did           1
dtype: object

In [ ]:
#finding min value based rows
emp_df[[]].apply('min', axis=1)

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\244777187.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  emp_df.apply('min', axis=1)

0    1
1    1
2    2
3    3
4    3
dtype: int64

In [ ]:
#finding total column values based rows
emp_df.apply('count', axis=1)

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [ ]:
emp_df = emp_df.append({'eno':700, 'ename':'abcdefx'}, ignore_index=True)

emp_df.tail(2)

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\162343524.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  emp_df = emp_df.append({'eno':700, 'ename':'abcdefx'}, ignore_index=True)

   eno    ename   salary  did
4  500      ram  20000.0  3.0
5  700  abcdefx      NaN  NaN

In [ ]:
#finding total column values based rows
emp_df.apply('count', axis=1)

0    4
1    4
2    4
3    4
4    4
5    2
dtype: int64

In [ ]:
#finding total rows values based colun
emp_df.apply('count')

eno       6
ename     6
salary    5
did       5
dtype: int64

In [ ]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eno     6 non-null      int64
 1   ename   6 non-null      object
 2   salary  5 non-null      float64
 3   did     5 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 320.0+ bytes

In [ ]:
emp_df.describe()

              eno        salary  did
count    6.000000      5.000000  5.0
mean   366.666667  21800.000000  2.0
std    216.024690   5585.696018  1.0
min    100.000000  15000.000000  1.0
25%    225.000000  20000.000000  1.0
50%    350.000000  20000.000000  2.0
75%    475.000000  24000.000000  3.0
max    700.000000  30000.000000  3.0

In [ ]:
emp_df.iloc[2,3] = 1000
emp_df

   eno    ename   salary     did
0  100    kumar  24000.0     1.0
1  200     abcd  20000.0     1.0
2  300      xyz  15000.0  1000.0
3  400    rahul  30000.0     3.0
4  500      ram  20000.0     3.0
5  700  abcdefx      NaN     NaN

In [ ]:
#finding min value based rows
emp_df.apply('min', axis=1)

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\244777187.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  emp_df.apply('min', axis=1)

0      1.0
1      1.0
2    300.0
3      3.0
4      3.0
5    700.0
dtype: float64

In [ ]:
#tranforming data using applymap
emp_df.applymap(lambda x:x*2)

    eno           ename   salary     did
0   200      kumarkumar  48000.0     2.0
1   400        abcdabcd  40000.0     2.0
2   600          xyzxyz  30000.0  2000.0
3   800      rahulrahul  60000.0     6.0
4  1000          ramram  40000.0     6.0
5  1400  abcdefxabcdefx      NaN     NaN

In [ ]:
emp_df

   eno    ename   salary     did
0  100    kumar  24000.0     1.0
1  200     abcd  20000.0     1.0
2  300      xyz  15000.0  1000.0
3  400    rahul  30000.0     3.0
4  500      ram  20000.0     3.0
5  700  abcdefx      NaN     NaN

In [ ]:
#tranforming data using applymap
emp_df[['eno', 'salary']].applymap(lambda x:x*2)

    eno   salary
0   200  48000.0
1   400  40000.0
2   600  30000.0
3   800  60000.0
4  1000  40000.0
5  1400      NaN

In [ ]:
#find 10% bonus for each emplayee
emp_df.eval('salary*0.15')

0    3600.0
1    3000.0
2    2250.0
3    4500.0
4    3000.0
5       NaN
dtype: float64

In [ ]:
#adding new column to the dataframe
emp_df['bonus_10']=emp_df['salary']*0.1

emp_df

   eno    ename   salary     did  bonus_10
0  100    kumar  24000.0     1.0    2400.0
1  200     abcd  20000.0     1.0    2000.0
2  300      xyz  15000.0  1000.0    1500.0
3  400    rahul  30000.0     3.0    3000.0
4  500      ram  20000.0     3.0    2000.0
5  700  abcdefx      NaN     NaN       NaN

In [ ]:
#add new column with total_salry based on salary and bonus
emp_df['total_salary'] = emp_df['salary'] + emp_df['bonus_10']

emp_df

   eno    ename   salary     did  bonus_10  total_salary
0  100    kumar  24000.0     1.0    2400.0       26400.0
1  200     abcd  20000.0     1.0    2000.0       22000.0
2  300      xyz  15000.0  1000.0    1500.0       16500.0
3  400    rahul  30000.0     3.0    3000.0       33000.0
4  500      ram  20000.0     3.0    2000.0       22000.0
5  700  abcdefx      NaN     NaN       NaN           NaN

In [ ]:
#updating column with total_salry based on salary and bonus
emp_df['total_salary'] = emp_df['salary'] + emp_df['salary'] * 0.15

emp_df

   eno    ename   salary     did  bonus_10  total_salary
0  100    kumar  24000.0     1.0    2400.0       27600.0
1  200     abcd  20000.0     1.0    2000.0       23000.0
2  300      xyz  15000.0  1000.0    1500.0       17250.0
3  400    rahul  30000.0     3.0    3000.0       34500.0
4  500      ram  20000.0     3.0    2000.0       23000.0
5  700  abcdefx      NaN     NaN       NaN           NaN

In [ ]:
emp_df.count()

eno             6
ename           6
salary          5
did             5
bonus_10        5
total_salary    5
dtype: int64

In [ ]:
#finding repeated rows
emp_df.value_counts()

eno  ename  salary   did     bonus_10  total_salary
100  kumar  24000.0  1.0     2400.0    27600.0         1
200  abcd   20000.0  1.0     2000.0    23000.0         1
300  xyz    15000.0  1000.0  1500.0    17250.0         1
400  rahul  30000.0  3.0     3000.0    34500.0         1
500  ram    20000.0  3.0     2000.0    23000.0         1
dtype: int64

In [ ]:
#finding repeated values
emp_df['did'].value_counts()

1.0       2
3.0       2
1000.0    1
Name: did, dtype: int64

In [ ]:
#finding missing values
# emp_df.isna()
emp_df.isnull()

     eno  ename  salary    did  bonus_10  total_salary
0  False  False   False  False     False         False
1  False  False   False  False     False         False
2  False  False   False  False     False         False
3  False  False   False  False     False         False
4  False  False   False  False     False         False
5  False  False    True   True      True          True

In [ ]:
#changing column names using rename()
emp_df = emp_df.rename(columns={'bonus_10':'bonus', 'did':'deptid'})

emp_df.head(2)

   eno  ename   salary  deptid   bonus  total_salary
0  100  kumar  24000.0     1.0  2400.0       27600.0
1  200   abcd  20000.0     1.0  2000.0       23000.0

In [ ]:
#changing index names using rename()
emp_df = emp_df.rename(index={0:'a', 1:'b'})

emp_df.head(5)

   eno  ename   salary  deptid   bonus  total_salary
a  100  kumar  24000.0     1.0  2400.0       27600.0
b  200   abcd  20000.0     1.0  2000.0       23000.0
2  300    xyz  15000.0  1000.0  1500.0       17250.0
3  400  rahul  30000.0     3.0  3000.0       34500.0
4  500    ram  20000.0     3.0  2000.0       23000.0

In [ ]:
emp_df.index

Index(['a', 'b', 2, 3, 4, 5], dtype='object')

In [ ]:
#finding duplicates
emp_df.duplicated()

a    False
b    False
2    False
3    False
4    False
5    False
dtype: bool

In [ ]:
#deleting duplicates
emp_df.drop_duplicates(inplace=True)

In [ ]:
emp_df

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#sorting rows based on salary
emp_df.sort_values(by='salary')

   eno    ename   salary  deptid   bonus  total_salary
2  300      xyz  15000.0  1000.0  1500.0       17250.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
4  500      ram  20000.0     3.0  2000.0       23000.0
a  100    kumar  24000.0     1.0  2400.0       27600.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#sorting rows based on salary decreasing order
emp_df.sort_values(by='salary', ascending=False)

   eno    ename   salary  deptid   bonus  total_salary
3  400    rahul  30000.0     3.0  3000.0       34500.0
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
4  500      ram  20000.0     3.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#sorting rows based on salary decreasing order
emp_df.sort_values(by=['deptid','salary'], ascending=False)

   eno    ename   salary  deptid   bonus  total_salary
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
emp_df.notna()

    eno  ename  salary  deptid  bonus  total_salary
a  True   True    True    True   True          True
b  True   True    True    True   True          True
2  True   True    True    True   True          True
3  True   True    True    True   True          True
4  True   True    True    True   True          True
5  True   True   False   False  False         False

In [ ]:
#deletring rows with missing values
emp_df_wona = emp_df.dropna()

In [ ]:
#deletring rows with missing values more than 1
emp_df.dropna(thresh=2)

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
emp_df

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
emp_df_wona

   eno  ename   salary  deptid   bonus  total_salary
a  100  kumar  24000.0     1.0  2400.0       27600.0
b  200   abcd  20000.0     1.0  2000.0       23000.0
2  300    xyz  15000.0  1000.0  1500.0       17250.0
3  400  rahul  30000.0     3.0  3000.0       34500.0
4  500    ram  20000.0     3.0  2000.0       23000.0

In [ ]:
#replacing missing values with 1500
emp_df.fillna(1500)

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx   1500.0  1500.0  1500.0        1500.0

In [ ]:
#replacing missing values with mean
emp_df.fillna(emp_df['salary'].mean())

   eno    ename   salary   deptid    bonus  total_salary
a  100    kumar  24000.0      1.0   2400.0       27600.0
b  200     abcd  20000.0      1.0   2000.0       23000.0
2  300      xyz  15000.0   1000.0   1500.0       17250.0
3  400    rahul  30000.0      3.0   3000.0       34500.0
4  500      ram  20000.0      3.0   2000.0       23000.0
5  700  abcdefx  21800.0  21800.0  21800.0       21800.0

In [ ]:
#replacing missing values with mean
emp_df.fillna(emp_df.mean())

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\2844951151.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  emp_df.fillna(emp_df.mean())

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx  21800.0   201.6  2180.0       25070.0

In [ ]:
#replacing missing value with forward fill
emp_df.fillna(method='ffill')

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx  20000.0     3.0  2000.0       23000.0

In [ ]:
#replacing missing value with backward fill
emp_df.fillna(method='bfill')

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#creating groups based on deptid
emp_df_group_depid = emp_df.groupby(by='deptid')

In [ ]:
#finding group key
emp_df_group_depid.keys

'deptid'

In [ ]:
#finding group
emp_df_group_depid.groups

{1.0: ['a', 'b'], 3.0: [3, 4], 1000.0: [2]}

In [ ]:
#creating groups based on eno
emp_df_group_eno = emp_df.groupby(by='eno')
emp_df_group_eno.groups

{100: ['a'], 200: ['b'], 300: [2], 400: [3], 500: [4], 700: [5]}

In [ ]:
emp_df_group_depid.agg(['mean'])

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\3489251813.py:1: FutureWarning: ['ename'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  emp_df_group_depid.agg(['mean'])

          eno   salary   bonus total_salary
         mean     mean    mean         mean
deptid
1.0     150.0  22000.0  2200.0      25300.0
3.0     450.0  25000.0  2500.0      28750.0
1000.0  300.0  15000.0  1500.0      17250.0

In [ ]:
emp_df_group_depid.agg(['max'])

        eno  ename   salary   bonus total_salary
        max    max      max     max          max
deptid
1.0     200  kumar  24000.0  2400.0      27600.0
3.0     500    ram  30000.0  3000.0      34500.0
1000.0  300    xyz  15000.0  1500.0      17250.0

In [ ]:
emp_df_group_depid.agg({'eno':'max', 'salary':'mean'})

        eno   salary
deptid
1.0     200  22000.0
3.0     500  25000.0
1000.0  300  15000.0

In [ ]:
#appeding rows
emp_df.append(emp_df)

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\3354520253.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  emp_df.append(emp_df)

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#appeding rows
emp_df.append([emp_df, emp_df])

C:\Users\HP\AppData\Local\Temp\ipykernel_94100\701844428.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  emp_df.append([emp_df, emp_df])

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#
dept_dict = {
    'deptid':[1,2,3,4],
    'dname':['Accounting', 'Sales', 'Marketing', 'IT'],
    'location':['Bang', 'Hyd', 'Bom', 'Bang']
}

dept_df = pd.DataFrame(dept_dict)

In [ ]:
dept_df

   deptid       dname location
0       1  Accounting     Bang
1       2       Sales      Hyd
2       3   Marketing      Bom
3       4          IT     Bang

In [ ]:
emp_df

   eno    ename   salary  deptid   bonus  total_salary
a  100    kumar  24000.0     1.0  2400.0       27600.0
b  200     abcd  20000.0     1.0  2000.0       23000.0
2  300      xyz  15000.0  1000.0  1500.0       17250.0
3  400    rahul  30000.0     3.0  3000.0       34500.0
4  500      ram  20000.0     3.0  2000.0       23000.0
5  700  abcdefx      NaN     NaN     NaN           NaN

In [ ]:
#selecting columns from different dataframes based on common column using merge
emp_df.merge(dept_df, how='inner', left_on='deptid', right_on='deptid')

   eno  ename   salary  deptid   bonus  total_salary       dname location
0  100  kumar  24000.0     1.0  2400.0       27600.0  Accounting     Bang
1  200   abcd  20000.0     1.0  2000.0       23000.0  Accounting     Bang
2  400  rahul  30000.0     3.0  3000.0       34500.0   Marketing      Bom
3  500    ram  20000.0     3.0  2000.0       23000.0   Marketing      Bom

In [ ]:
#selecting columns from different dataframes based on common column using merge
emp_df.merge(dept_df, how='left', left_on='deptid', right_on='deptid')

   eno    ename   salary  deptid   bonus  total_salary       dname location
0  100    kumar  24000.0     1.0  2400.0       27600.0  Accounting     Bang
1  200     abcd  20000.0     1.0  2000.0       23000.0  Accounting     Bang
2  300      xyz  15000.0  1000.0  1500.0       17250.0         NaN      NaN
3  400    rahul  30000.0     3.0  3000.0       34500.0   Marketing      Bom
4  500      ram  20000.0     3.0  2000.0       23000.0   Marketing      Bom
5  700  abcdefx      NaN     NaN     NaN           NaN         NaN      NaN

In [ ]:
#selecting columns from different dataframes based on common column using merge
emp_df.merge(dept_df, how='right', left_on='deptid', right_on='deptid')

     eno  ename   salary  deptid   bonus  total_salary       dname location
0  100.0  kumar  24000.0     1.0  2400.0       27600.0  Accounting     Bang
1  200.0   abcd  20000.0     1.0  2000.0       23000.0  Accounting     Bang
2    NaN    NaN      NaN     2.0     NaN           NaN       Sales      Hyd
3  400.0  rahul  30000.0     3.0  3000.0       34500.0   Marketing      Bom
4  500.0    ram  20000.0     3.0  2000.0       23000.0   Marketing      Bom
5    NaN    NaN      NaN     4.0     NaN           NaN          IT     Bang

In [ ]:
#selecting columns from different dataframes based on common column using merge
emp_df.merge(dept_df, how='outer', left_on='deptid', right_on='deptid')

     eno    ename   salary  deptid   bonus  total_salary       dname location
0  100.0    kumar  24000.0     1.0  2400.0       27600.0  Accounting     Bang
1  200.0     abcd  20000.0     1.0  2000.0       23000.0  Accounting     Bang
2  300.0      xyz  15000.0  1000.0  1500.0       17250.0         NaN      NaN
3  400.0    rahul  30000.0     3.0  3000.0       34500.0   Marketing      Bom
4  500.0      ram  20000.0     3.0  2000.0       23000.0   Marketing      Bom
5  700.0  abcdefx      NaN     NaN     NaN           NaN         NaN      NaN
6    NaN      NaN      NaN     2.0     NaN           NaN       Sales      Hyd
7    NaN      NaN      NaN     4.0     NaN           NaN          IT     Bang

In [ ]:
#selecting columns from different dataframes based on common column using merge
emp_df.merge(dept_df, how='cross')

,eno,ename,salary,deptid_x,bonus,total_salary,deptid_y,dname,location
0,100,kumar,24000.0,1.0,2400.0,27600.0,1,Accounting,Bang
1,100,kumar,24000.0,1.0,2400.0,27600.0,2,Sales,Hyd
2,100,kumar,24000.0,1.0,2400.0,27600.0,3,Marketing,Bom
3,100,kumar,24000.0,1.0,2400.0,27600.0,4,IT,Bang
4,200,abcd,20000.0,1.0,2000.0,23000.0,1,Accounting,Bang
5,200,abcd,20000.0,1.0,2000.0,23000.0,2,Sales,Hyd
6,200,abcd,20000.0,1.0,2000.0,23000.0,3,Marketing,Bom
7,200,abcd,20000.0,1.0,2000.0,23000.0,4,IT,Bang
8,300,xyz,15000.0,1000.0,1500.0,17250.0,1,Accounting,Bang
9,300,xyz,15000.0,1000.0,1500.0,17250.0,2,Sales,Hyd
10,300,xyz,15000.0,1000.0,1500.0,17250.0,3,Marketing,Bom
11,300,xyz,15000.0,1000.0,1500.0,17250.0,4,IT,Bang
12,400,rahul,30000.0,3.0,3000.0,34500.0,1,Accounting,Bang
13,400,rahul,30000.0,3.0,3000.0,34500.0,2,Sales,Hyd
14,400,rahul,30000.0,3.0,3000.0,34500.0,3,Marketing,Bom
15,400,rahul,30000.0,3.0,3000.0,34500.0,4,IT,Bang
16,500,ram,20000.0,3.0,2000.0,23000.0,1,Accounting,Bang
17,500,ram,20000.0,3.0,2000.0,23000.0,2,Sales,Hyd
18,500,ram,20000.0,3.0,2000.0,23000.0,3,Marketing,Bom
19,500,ram,20000.0,3.0,2000.0,23000.0,4,IT,Bang
20,700,abcdefx,NaN,NaN,NaN,NaN,1,Accounting,Bang
21,700,abcdefx,NaN,NaN,NaN,NaN,2,Sales,Hyd
22,700,abcdefx,NaN,NaN,NaN,NaN,3,Marketing,Bom
23,700,abcdefx,NaN,NaN,NaN,NaN,4,IT,Bang

In [ ]:
emp_df.merge(dept_df, how='cross').shape

(24, 9)